<?php

return [
    "accepted" => "دی: وصف کو قبول کرنا ضروری ہے۔",
    "active_url" => "دی: وصف ایک درست یو آر ایل نہیں ہے۔",
    "after" => "دی: وصف کے بعد کی تاریخ ہونی چاہئے: تاریخ۔",
    "after_or_equal" => "دی: وصف کے بعد یا اس کے برابر تاریخ ہونی چاہئے: تاریخ۔",
    "alpha" => "دی: وصف میں صرف خطوط شامل ہوسکتے ہیں۔",
    "alpha_dash" => "دی: وصف میں صرف حرف ، نمبر ، ڈیش اور انڈر سکورز شامل ہوسکتے ہیں۔",
    "alpha_num" => "دی: وصف میں صرف خط اور نمبر شامل ہوسکتے ہیں۔",
    "array" => "دی: وصف ایک صف ہونا چاہئے۔",
    "before" => "دی: وصف سے پہلے ایک تاریخ ہونی چاہئے: تاریخ۔",
    "before_or_equal" => "دی: وصف سے پہلے یا اس کے برابر تاریخ ہونی چاہئے: تاریخ۔",
    "between" => [
        "numeric" => "دی: وصف کے درمیان ہونا ضروری ہے: کم سے کم اور: زیادہ سے زیادہ۔",
        "file" => "دی: وصف کے درمیان ہونا ضروری ہے: کم سے کم اور: زیادہ سے زیادہ کلو بائٹس۔",
        "string" => "دی: وصف کے درمیان ہونا ضروری ہے: کم سے کم اور: زیادہ سے زیادہ کردار۔",
        "array" => "دی: وصف کے درمیان ہونا ضروری ہے: کم سے کم اور: زیادہ سے زیادہ اشیاء۔"
    ],
    "boolean" => "دی: وصف کا میدان صحیح یا غلط ہونا چاہئے۔",
    "confirmed" => "دی: وصف کی تصدیق مماثل نہیں ہے۔",
    "date" => "دی: وصف ایک درست تاریخ نہیں ہے۔",
    "date_equals" => "دی: وصف کے برابر تاریخ ہونی چاہئے: تاریخ۔",
    "date_format" => "دی: وصف فارمیٹ: فارمیٹ سے مماثل نہیں ہے۔",
    "different" => "دی: وصف اور: دوسرے کو مختلف ہونا چاہئے۔",
    "digits" => "دی: وصف ہونا ضروری ہے: ہندسوں کے ہندسے۔",
    "digits_between" => "دی: وصف کے درمیان ہونا ضروری ہے: کم سے کم اور: زیادہ سے زیادہ ہندسے۔",
    "dimensions" => "دی: وصف میں تصویری طول و عرض ہے۔",
    "distinct" => "دی: وصف فیلڈ کی ایک ڈپلیکیٹ ویلیو ہے۔",
    "email" => "دی: وصف ایک درست ای میل ایڈریس ہونا چاہئے۔",
    "ends_with" => "دی: وصف مندرجہ ذیل میں سے کسی ایک کے ساتھ ختم ہونا چاہئے:: اقدار۔",
    "exists" => "منتخب: وصف غلط ہے۔",
    "file" => "دی: وصف ایک فائل ہونی چاہئے۔",
    "filled" => "دی: وصف فیلڈ کی ایک قدر ہونی چاہئے۔",
    "gt" => [
        "numeric" => "دی: وصف سے زیادہ ہونا چاہئے: قیمت۔",
        "file" => "دی: وصف سے زیادہ ہونا چاہئے: ویلیو کلو بائٹس۔",
        "string" => "دی: وصف سے زیادہ ہونا چاہئے: قدر کے حروف۔",
        "array" => "دی: وصف میں اس سے زیادہ ہونا ضروری ہے: ویلیو آئٹمز۔"
    ],
    "gte" => [
        "numeric" => "دی: وصف سے زیادہ یا مساوی ہونا چاہئے: قدر۔",
        "file" => "دی: وصف سے زیادہ یا اس کے برابر ہونا چاہئے: ویلیو کلو بائٹس۔",
        "string" => "دی: وصف سے زیادہ یا مساوی ہونا چاہئے: قدر کے کردار۔",
        "array" => "دی: وصف ہونا ضروری ہے: قیمتوں کی قیمت یا اس سے زیادہ۔"
    ],
    "image" => "دی: وصف ایک شبیہہ ہونا چاہئے۔",
    "in" => "منتخب: وصف غلط ہے۔",
    "in_array" => "دی: وصف فیلڈ موجود نہیں ہے: دوسرا۔",
    "integer" => "دی: وصف ایک عدد ہونا چاہئے۔",
    "ip" => "دی: وصف ایک درست IP ایڈریس ہونا چاہئے۔",
    "ipv4" => "دی: وصف ایک درست IPv4 ایڈریس ہونا چاہئے۔",
    "ipv6" => "دی: وصف ایک درست IPv6 ایڈریس ہونا چاہئے۔",
    "json" => "دی: وصف ایک درست JSON سٹرنگ ہونا چاہئے۔",
    "lt" => [
        "numeric" => "دی: وصف سے کم ہونا چاہئے: قیمت۔",
        "file" => "دی: وصف سے کم ہونا چاہئے: ویلیو کلو بائٹس۔",
        "string" => "دی: وصف سے کم ہونا چاہئے: قدر کے کردار۔",
        "array" => "دی: وصف میں اس سے کم ہونا ضروری ہے: ویلیو آئٹمز۔"
    ],
    "lte" => [
        "numeric" => "دی: وصف سے کم یا برابر ہونا چاہئے: قدر۔",
        "file" => "دی: وصف سے کم یا اس کے برابر ہونا چاہئے: ویلیو کلو بائٹس۔",
        "string" => "دی: وصف سے کم یا مساوی ہونا چاہئے: قدر کے حروف۔",
        "array" => "دی: وصف میں اس سے زیادہ نہیں ہونا چاہئے: قیمت والے آئٹمز۔"
    ],
    "max" => [
        "numeric" => "دی: وصف سے زیادہ نہیں ہوسکتا ہے: زیادہ سے زیادہ۔",
        "file" => "دی: وصف سے زیادہ نہیں ہوسکتا ہے: زیادہ سے زیادہ کلو بائٹس۔",
        "string" => "دی: وصف سے زیادہ نہیں ہوسکتا ہے: زیادہ سے زیادہ کردار۔",
        "array" => "دی: وصف میں اس سے زیادہ نہیں ہوسکتا ہے: زیادہ سے زیادہ اشیاء۔"
    ],
    "mimes" => "دی: وصف کی قسم کی فائل ہونی چاہئے:: اقدار۔",
    "mimetypes" => "دی: وصف کی قسم کی فائل ہونی چاہئے:: اقدار۔",
    "min" => [
        "numeric" => "دی: وصف کم از کم ہونا چاہئے: منٹ۔",
        "file" => "دی: وصف کم از کم ہونا چاہئے: کم سے کم کلو بائٹس۔",
        "string" => "دی: وصف کم از کم ہونا چاہئے: کم سے کم کردار۔",
        "array" => "دی: وصف میں کم از کم ہونا ضروری ہے: کم سے کم اشیاء۔"
    ],
    "not_in" => "منتخب: وصف غلط ہے۔",
    "not_regex" => ": وصف کی شکل غلط ہے۔",
    "numeric" => "دی: وصف ایک نمبر ہونا چاہئے۔",
    "password" => "پاس ورڈ غلط ہے۔",
    "present" => "دی: وصف کا فیلڈ ضرور موجود ہونا چاہئے۔",
    "regex" => ": وصف کی شکل غلط ہے۔",
    "required" => "دی: وصف فیلڈ کی ضرورت ہے۔",
    "required_if" => "دی: وصف فیلڈ کی ضرورت ہوتی ہے جب: دوسرا ہے: قدر۔",
    "required_unless" => "دی: وصف کا میدان اس وقت تک ضروری ہے جب تک کہ: دوسرا نہیں: اقدار۔",
    "required_with" => ": وصف فیلڈ کی ضرورت ہوتی ہے جب: اقدار موجود ہیں۔",
    "required_with_all" => ": وصف فیلڈ کی ضرورت ہوتی ہے جب: اقدار موجود ہوں۔",
    "required_without" => "دی: وصف فیلڈ کی ضرورت ہوتی ہے جب: اقدار موجود نہیں ہیں۔",
    "required_without_all" => ": وصف فیلڈ کی ضرورت ہوتی ہے جب کوئی بھی نہیں: اقدار موجود ہیں۔",
    "same" => "دی: وصف اور: دوسرے کو مماثل ہونا چاہئے۔",
    "size" => [
        "numeric" => "دی: وصف ہونا ضروری ہے: سائز۔",
        "file" => "دی: وصف ہونا ضروری ہے: سائز کلو بائٹس۔",
        "string" => "دی: وصف ہونا ضروری ہے: سائز کے حروف۔",
        "array" => "دی: وصف پر مشتمل ہونا ضروری ہے: سائز کی اشیاء۔"
    ],
    "starts_with" => "دی: وصف کو مندرجہ ذیل میں سے کسی ایک کے ساتھ شروع کرنا ہوگا:: اقدار۔",
    "string" => "دی: وصف ایک تار ہونا چاہئے۔",
    "timezone" => "دی: وصف ایک درست زون ہونا چاہئے۔",
    "unique" => "دی: وصف پہلے ہی لیا گیا ہے۔",
    "uploaded" => "دی: وصف اپ لوڈ کرنے میں ناکام رہا۔",
    "url" => ": وصف کی شکل غلط ہے۔",
    "uuid" => "دی: وصف ایک درست UUID ہونا چاہئے۔",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "کسٹم-میسج"
        ]
    ],
    "attributes" => []
];
