<?php

return [
    "accepted" => "দ্য: অ্যাট্রিবিউট অবশ্যই গ্রহণ করা উচিত।",
    "active_url" => "দ্য: অ্যাট্রিবিউট কোনও বৈধ ইউআরএল নয়।",
    "after" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি তারিখ হতে হবে: তারিখ।",
    "after_or_equal" => ":: বৈশিষ্ট্যটি অবশ্যই একটি তারিখ হতে হবে বা তার সমান: তারিখ।",
    "alpha" => "দ্য: অ্যাট্রিবিউটটিতে কেবল অক্ষর থাকতে পারে।",
    "alpha_dash" => ": বৈশিষ্ট্যটিতে কেবল অক্ষর, সংখ্যা, ড্যাশ এবং আন্ডারস্কোর থাকতে পারে।",
    "alpha_num" => ": বৈশিষ্ট্যটি কেবল অক্ষর এবং সংখ্যা থাকতে পারে।",
    "array" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি অ্যারে হতে হবে।",
    "before" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি তারিখ হতে হবে: তারিখ।",
    "before_or_equal" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি তারিখ হতে হবে বা সমান: তারিখ।",
    "between" => [
        "numeric" => "দ্য: অ্যাট্রিবিউট অবশ্যই এর মধ্যে থাকতে হবে: মিনিট এবং: সর্বোচ্চ।",
        "file" => "দ্য: অ্যাট্রিবিউট অবশ্যই এর মধ্যে থাকতে হবে: মিনিট এবং: সর্বোচ্চ কিলোবাইট।",
        "string" => "দ্য: অ্যাট্রিবিউট অবশ্যই এর মধ্যে থাকতে হবে: মিনিট এবং: সর্বোচ্চ অক্ষর।",
        "array" => "দ্য: অ্যাট্রিবিউট অবশ্যই এর মধ্যে থাকতে হবে: মিনিট এবং: সর্বোচ্চ আইটেম।"
    ],
    "boolean" => "দ্য: অ্যাট্রিবিউট ফিল্ডটি অবশ্যই সত্য বা মিথ্যা হতে হবে।",
    "confirmed" => "দ্য: অ্যাট্রিবিউট কনফার্মেশন মেলে না।",
    "date" => "দ্য: অ্যাট্রিবিউট কোনও বৈধ তারিখ নয়।",
    "date_equals" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি তারিখ হতে হবে: তারিখ।",
    "date_format" => "দ্য: অ্যাট্রিবিউট ফর্ম্যাটটির সাথে মেলে না: ফর্ম্যাট।",
    "different" => "দ্য: অ্যাট্রিবিউট এবং: অন্যান্য অবশ্যই আলাদা হতে হবে।",
    "digits" => "দ্য: অ্যাট্রিবিউট অবশ্যই: অঙ্কগুলি সংখ্যা।",
    "digits_between" => "দ্য: অ্যাট্রিবিউট অবশ্যই এর মধ্যে থাকতে হবে: মিনিট এবং: সর্বোচ্চ অঙ্ক।",
    "dimensions" => "দ্য: অ্যাট্রিবিউটটিতে অবৈধ চিত্রের মাত্রা রয়েছে।",
    "distinct" => "দ্য: অ্যাট্রিবিউট ফিল্ডের একটি সদৃশ মান রয়েছে।",
    "email" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি বৈধ ইমেল ঠিকানা হতে হবে।",
    "ends_with" => "দ্য: অ্যাট্রিবিউট অবশ্যই নিম্নলিখিতগুলির একটির সাথে শেষ করতে হবে:: মানগুলি।",
    "exists" => "নির্বাচিত: বৈশিষ্ট্যটি অবৈধ।",
    "file" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি ফাইল হতে হবে।",
    "filled" => "দ্য: অ্যাট্রিবিউট ফিল্ডের অবশ্যই একটি মান থাকতে হবে।",
    "gt" => [
        "numeric" => "দ্য: অ্যাট্রিবিউট অবশ্যই এর চেয়ে বড় হতে হবে: মান।",
        "file" => "দ্য: অ্যাট্রিবিউট অবশ্যই এর চেয়ে বড় হতে হবে: মান কিলোবাইট।",
        "string" => "দ্য: অ্যাট্রিবিউট অবশ্যই এর চেয়ে বড় হতে হবে: মান অক্ষর।",
        "array" => "দ্য: অ্যাট্রিবিউট অবশ্যই আরও বেশি কিছু থাকতে হবে: মান আইটেম।"
    ],
    "gte" => [
        "numeric" => ":: বৈশিষ্ট্যটি অবশ্যই বা সমান বা সমান হতে হবে: মান।",
        "file" => "দ্য: অ্যাট্রিবিউট অবশ্যই বা সমান বা সমান হতে হবে: মান কিলোবাইট।",
        "string" => ": বৈশিষ্ট্যটি অবশ্যই বৃহত্তর বা সমান হতে হবে: মান অক্ষর।",
        "array" => "দ্য: অ্যাট্রিবিউট থাকতে হবে: মান আইটেম বা আরও অনেক কিছু।"
    ],
    "image" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি চিত্র হতে হবে।",
    "in" => "নির্বাচিত: বৈশিষ্ট্যটি অবৈধ।",
    "in_array" => "দ্য: অ্যাট্রিবিউট ফিল্ডটিতে বিদ্যমান নেই: অন্যান্য।",
    "integer" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি পূর্ণসংখ্যা হতে হবে।",
    "ip" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি বৈধ আইপি ঠিকানা হতে হবে।",
    "ipv4" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি বৈধ আইপিভি 4 ঠিকানা হতে হবে।",
    "ipv6" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি বৈধ আইপিভি 6 ঠিকানা হতে হবে।",
    "json" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি বৈধ জেএসএন স্ট্রিং হতে হবে।",
    "lt" => [
        "numeric" => "দ্য: অ্যাট্রিবিউট অবশ্যই কম হতে হবে: মান।",
        "file" => "দ্য: অ্যাট্রিবিউট অবশ্যই কম হতে হবে: মান কিলোবাইট।",
        "string" => "দ্য: অ্যাট্রিবিউট অবশ্যই কম হতে হবে: মান অক্ষর।",
        "array" => "দ্য: অ্যাট্রিবিউটটির চেয়ে কম থাকতে হবে: মান আইটেম।"
    ],
    "lte" => [
        "numeric" => ": বৈশিষ্ট্যটি অবশ্যই কম বা সমান হতে হবে: মান।",
        "file" => "দ্য: অ্যাট্রিবিউট অবশ্যই কম বা সমান হতে হবে: মান কিলোবাইট।",
        "string" => ": বৈশিষ্ট্যটি অবশ্যই কম বা সমান হতে হবে: মান অক্ষর।",
        "array" => "দ্য: অ্যাট্রিবিউটটির চেয়ে বেশি কিছু থাকতে হবে না: মান আইটেম।"
    ],
    "max" => [
        "numeric" => "দ্য: অ্যাট্রিবিউট এর চেয়ে বড় নাও হতে পারে: সর্বোচ্চ।",
        "file" => "দ্য: অ্যাট্রিবিউট এর চেয়ে বড় নাও হতে পারে: সর্বোচ্চ কিলোবাইট।",
        "string" => "দ্য: অ্যাট্রিবিউট এর চেয়ে বড় নাও হতে পারে: সর্বোচ্চ অক্ষর।",
        "array" => "দ্য: অ্যাট্রিবিউট এর চেয়ে বেশি নাও থাকতে পারে: সর্বোচ্চ আইটেম।"
    ],
    "mimes" => "দ্য: অ্যাট্রিবিউট অবশ্যই প্রকারের একটি ফাইল হতে হবে:: মানগুলি।",
    "mimetypes" => "দ্য: অ্যাট্রিবিউট অবশ্যই প্রকারের একটি ফাইল হতে হবে:: মানগুলি।",
    "min" => [
        "numeric" => "দ্য: অ্যাট্রিবিউট অবশ্যই কমপক্ষে: মিনিট।",
        "file" => "দ্য: অ্যাট্রিবিউট অবশ্যই কমপক্ষে: মিনিট কিলোবাইট।",
        "string" => "দ্য: অ্যাট্রিবিউট অবশ্যই কমপক্ষে: মিনিট অক্ষর।",
        "array" => "দ্য: অ্যাট্রিবিউট অবশ্যই কমপক্ষে: মিনিট আইটেম থাকতে হবে।"
    ],
    "not_in" => "নির্বাচিত: বৈশিষ্ট্যটি অবৈধ।",
    "not_regex" => "দ্য: অ্যাট্রিবিউট ফর্ম্যাটটি অবৈধ।",
    "numeric" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি সংখ্যা হতে হবে।",
    "password" => "পাসওয়ার্ডটি ভুল।",
    "present" => "দ্য: অ্যাট্রিবিউট ফিল্ড অবশ্যই উপস্থিত থাকতে হবে।",
    "regex" => "দ্য: অ্যাট্রিবিউট ফর্ম্যাটটি অবৈধ।",
    "required" => ":: বৈশিষ্ট্য ক্ষেত্র প্রয়োজন।",
    "required_if" => ": যখন: বৈশিষ্ট্য ক্ষেত্রের প্রয়োজন হয়: অন্যটি: মান।",
    "required_unless" => "এটি: বৈশিষ্ট্য ক্ষেত্রের প্রয়োজন হয় যদি না: অন্যটি থাকে: মানগুলি।",
    "required_with" => "যখন: মান উপস্থিত থাকে: অ্যাট্রিবিউট ক্ষেত্রটি প্রয়োজনীয়।",
    "required_with_all" => "যখন: মান উপস্থিত থাকে: অ্যাট্রিবিউট ক্ষেত্রটি প্রয়োজনীয়।",
    "required_without" => "যখন: মানগুলি উপস্থিত থাকে না তখন অ্যাট্রিবিউট ক্ষেত্রটি প্রয়োজনীয়।",
    "required_without_all" => "যখন: মান উপস্থিত না থাকে তখন অ্যাট্রিবিউট ক্ষেত্রটি প্রয়োজনীয়।",
    "same" => "দ্য: অ্যাট্রিবিউট এবং: অন্যান্য অবশ্যই মেলে।",
    "size" => [
        "numeric" => "দ্য: অ্যাট্রিবিউট অবশ্যই: আকার।",
        "file" => "দ্য: অ্যাট্রিবিউট অবশ্যই: আকার কিলোবাইট।",
        "string" => "দ্য: অ্যাট্রিবিউট অবশ্যই: আকারের অক্ষর।",
        "array" => "দ্য: অ্যাট্রিবিউট অবশ্যই: আকারের আইটেমগুলি।"
    ],
    "starts_with" => "দ্য: অ্যাট্রিবিউট অবশ্যই নিম্নলিখিতগুলির মধ্যে একটি দিয়ে শুরু করতে হবে:: মানগুলি।",
    "string" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি স্ট্রিং হতে হবে।",
    "timezone" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি বৈধ অঞ্চল হতে হবে।",
    "unique" => "দ্য: অ্যাট্রিবিউট ইতিমধ্যে নেওয়া হয়েছে।",
    "uploaded" => "দ্য: অ্যাট্রিবিউট আপলোড করতে ব্যর্থ হয়েছে।",
    "url" => "দ্য: অ্যাট্রিবিউট ফর্ম্যাটটি অবৈধ।",
    "uuid" => "দ্য: অ্যাট্রিবিউট অবশ্যই একটি বৈধ uuid হতে হবে।",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "কাস্টম-মেসেজ"
        ]
    ],
    "attributes" => []
];