<?php

return [
    "accepted" => "Атрибутът: Атрибутът трябва да бъде приет.",
    "active_url" => "Атрибутът: не е валиден URL адрес.",
    "after" => "Атрибутът: Атрибутът трябва да е дата след: дата.",
    "after_or_equal" => "Атрибутът: Атрибутът трябва да бъде дата след или равна на: дата.",
    "alpha" => "Атрибутът: може да съдържа само букви.",
    "alpha_dash" => "Атрибутът: Атрибутът може да съдържа само букви, цифри, тирета и подчертания.",
    "alpha_num" => "Атрибутът: Атрибутът може да съдържа само букви и цифри.",
    "array" => "Атрибутът: Атрибутът трябва да е масив.",
    "before" => "Атрибутът: Атрибутът трябва да е дата преди: дата.",
    "before_or_equal" => "Атрибутът: Атрибутът трябва да бъде дата преди или равна на: дата.",
    "between" => [
        "numeric" => "Атрибутът: Атрибутът трябва да е между: min и: max.",
        "file" => "Атрибутът: Атрибутът трябва да бъде между: Мин и: Макс килобайти.",
        "string" => "Атрибутът: Атрибутът трябва да бъде между: Мин и: Макс знаци.",
        "array" => "Атрибутът: Атрибутът трябва да има между: min и: max елементи."
    ],
    "boolean" => "Полето: атрибут трябва да е вярно или невярно.",
    "confirmed" => "Потвърждението на атрибута не съвпада.",
    "date" => "Атрибутът: Атрибутът не е валидна дата.",
    "date_equals" => "Атрибутът: Дата трябва да е дата, равна на: дата.",
    "date_format" => "Атрибутът: Атрибутът не съвпада с формата: формат.",
    "different" => "Атрибутът: Атрибут и: Други трябва да са различни.",
    "digits" => "Атрибутът: Атрибутът трябва да бъде: цифри цифри.",
    "digits_between" => "Атрибутът: Атрибутът трябва да е между: min и: max цифри.",
    "dimensions" => "Атрибутът: има невалидни размери на изображението.",
    "distinct" => "Полето: атрибут има дублирана стойност.",
    "email" => "Атрибутът: Атрибутът трябва да е валиден имейл адрес.",
    "ends_with" => "Атрибутът: Атрибутът трябва да завърши с едно от следните :: стойности.",
    "exists" => "Избраният: атрибутът е невалиден.",
    "file" => "Атрибутът: Атрибутът трябва да е файл.",
    "filled" => "Полето: атрибут трябва да има стойност.",
    "gt" => [
        "numeric" => "Атрибутът: Атрибутът трябва да е по -голям от: Стойност.",
        "file" => "Атрибутът: Атрибутът трябва да е по -голям от: Централни килобайти.",
        "string" => "Атрибутът: Атрибутът трябва да е по -голям от: Стойните символи.",
        "array" => "Атрибутът: Атрибутът трябва да има повече от: Стойните елементи."
    ],
    "gte" => [
        "numeric" => "Атрибутът: Атрибутът трябва да е по -голям или равен: стойност.",
        "file" => "Атрибутът: Атрибутът трябва да е по -голям или равен: стойност на килобайтите.",
        "string" => "Атрибутът: Атрибутът трябва да е по -голям или равен: знаци на стойността.",
        "array" => "Атрибутът: Атрибутът трябва да има: стойностни елементи или повече."
    ],
    "image" => "Атрибутът: Атрибутът трябва да е изображение.",
    "in" => "Избраният: атрибутът е невалиден.",
    "in_array" => "Полето: атрибут не съществува в: Други.",
    "integer" => "Атрибутът: Атрибутът трябва да е цяло число.",
    "ip" => "Атрибутът: Атрибутът трябва да е валиден IP адрес.",
    "ipv4" => "Атрибутът: Атрибутът трябва да е валиден IPv4 адрес.",
    "ipv6" => "Атрибутът: Атрибутът трябва да е валиден IPv6 адрес.",
    "json" => "Атрибутът: Атрибутът трябва да е валиден JSON низ.",
    "lt" => [
        "numeric" => "Атрибутът: Атрибутът трябва да е по -малък от: Стойност.",
        "file" => "Атрибутът: Атрибутът трябва да е по -малък от: Стойните килобайти.",
        "string" => "Атрибутът: Атрибутът трябва да е по -малък от: Стойните символи.",
        "array" => "Атрибутът: Атрибутът трябва да има по -малко от: стойностни елементи."
    ],
    "lte" => [
        "numeric" => "Атрибутът: Атрибутът трябва да е по -малък или равен: стойност.",
        "file" => "Атрибутът: Атрибутът трябва да е по -малък или равен: стойност на килобайтите.",
        "string" => "Атрибутът: Атрибутът трябва да е по -малък или равен: Стойните символи.",
        "array" => "Атрибутът: Атрибутът не трябва да има повече от: Стойните елементи."
    ],
    "max" => [
        "numeric" => "Атрибутът: може да не е по -голям от: max.",
        "file" => "Атрибутът: Атрибутът може да не е по -голям от: Макс килобайти.",
        "string" => "Атрибутът: Атрибутът може да не е по -голям от: MAX символи.",
        "array" => "Атрибутът: Атрибутът може да няма повече от: максимални елементи."
    ],
    "mimes" => "Атрибутът: Атрибутът трябва да е файл от тип :: стойности.",
    "mimetypes" => "Атрибутът: Атрибутът трябва да е файл от тип :: стойности.",
    "min" => [
        "numeric" => "Атрибутът: Атрибутът трябва да е поне: мин.",
        "file" => "Атрибутът: Атрибутът трябва да бъде поне: мин килобайти.",
        "string" => "Атрибутът: Атрибутът трябва да бъде поне: Мин символи.",
        "array" => "Атрибутът: Атрибутът трябва да има поне: мин елементи."
    ],
    "not_in" => "Избраният: атрибутът е невалиден.",
    "not_regex" => "Форматът на атрибута е невалиден.",
    "numeric" => "Атрибутът: Атрибутът трябва да е число.",
    "password" => "Паролата е неправилна.",
    "present" => "Полето: Атрибутът трябва да присъства.",
    "regex" => "Форматът на атрибута е невалиден.",
    "required" => "Необходимо е полето: атрибут.",
    "required_if" => "Полето: атрибут се изисква, когато: Друго е: Стойност.",
    "required_unless" => "Полето: атрибут се изисква, освен ако: Други е в: Стойности.",
    "required_with" => "Полето: атрибут се изисква, когато: Стойности са налице.",
    "required_with_all" => "Полето: атрибут се изисква, когато: Стойности са налице.",
    "required_without" => "Полето: атрибут се изисква, когато: стойности не присъстват.",
    "required_without_all" => "Полето: атрибут не се изисква, когато не са налице стойности.",
    "same" => "Атрибутът: Атрибут и: Други трябва да съвпадат.",
    "size" => [
        "numeric" => "Атрибутът: Атрибутът трябва да бъде: Размер.",
        "file" => "Атрибутът: Атрибутът трябва да бъде: Размери килобайти.",
        "string" => "Атрибутът: Атрибутът трябва да бъде: Размери знаци.",
        "array" => "Атрибутът: Атрибутът трябва да съдържа: Размери."
    ],
    "starts_with" => "Атрибутът: Атрибутът трябва да започне с едно от следните :: стойности.",
    "string" => "Атрибутът: Атрибутът трябва да е низ.",
    "timezone" => "Атрибутът: Атрибутът трябва да е валидна зона.",
    "unique" => "Атрибутът: атрибутът вече е взет.",
    "uploaded" => "Атрибутът: не успя да се качи.",
    "url" => "Форматът на атрибута е невалиден.",
    "uuid" => "Атрибутът: Атрибутът трябва да е валиден UUID.",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "по поръчка"
        ]
    ],
    "attributes" => []
];
