<?php

return [
    "accepted" => "：属性を受け入れる必要があります。",
    "active_url" => "：属性は有効なURLではありません。",
    "after" => "：属性は次の日付でなければなりません：日付。",
    "after_or_equal" => "：属性は、日付以降または等しい日付でなければなりません。",
    "alpha" => "：属性には文字のみが含まれる場合があります。",
    "alpha_dash" => "：属性には、文字、数字、ダッシュ、アンダースコアのみが含まれる場合があります。",
    "alpha_num" => "：属性には文字と数字のみが含まれる場合があります。",
    "array" => "：属性は配列でなければなりません。",
    "before" => "：属性は前の日付でなければなりません：日付。",
    "before_or_equal" => "：属性は、以前または等しい日付でなければなりません：日付。",
    "between" => [
        "numeric" => "：属性は次の間でなければなりません：minと：max。",
        "file" => "：属性は次の間でなければなりません：minと：max kilobytes。",
        "string" => "：属性は次の間でなければなりません：minと：max文字。",
        "array" => "：属性は次の間である必要があります：minと：max items。"
    ],
    "boolean" => "：属性フィールドはtrueまたはfalseでなければなりません。",
    "confirmed" => "：属性確認は一致しません。",
    "date" => "：属性は有効な日付ではありません。",
    "date_equals" => "：属性は、日付に等しい日付でなければなりません。",
    "date_format" => "：属性はフォーマットと一致しません：形式。",
    "different" => "：属性および：その他は異なる必要があります。",
    "digits" => "：属性は次のようにする必要があります桁数字。",
    "digits_between" => "：属性は次の間でなければなりません：minと：max digits。",
    "dimensions" => "：属性には無効な画像寸法があります。",
    "distinct" => "：属性フィールドには重複した値があります。",
    "email" => "：属性は有効な電子メールアドレスである必要があります。",
    "ends_with" => "：属性は次のいずれかで終了する必要があります。",
    "exists" => "選択された：属性は無効です。",
    "file" => "：属性はファイルである必要があります。",
    "filled" => "：属性フィールドには値が必要です。",
    "gt" => [
        "numeric" => "：属性は以下より大きくなければなりません。",
        "file" => "：属性は以下より大きくなければなりません：値kilobytes。",
        "string" => "：属性は以下より大きくなければなりません：値文字。",
        "array" => "：属性には以下以上のものが必要です。値アイテム。"
    ],
    "gte" => [
        "numeric" => "：属性は、値以上でなければなりません：値。",
        "file" => "：属性は等しくなければなりません：値キロバイト。",
        "string" => "：属性は、値以上でなければなりません：値文字。",
        "array" => "：属性が必要です：値アイテム以上。"
    ],
    "image" => "：属性は画像でなければなりません。",
    "in" => "選択された：属性は無効です。",
    "in_array" => "：属性フィールドは存在しません：その他。",
    "integer" => "：属性は整数でなければなりません。",
    "ip" => "：属性は有効なIPアドレスである必要があります。",
    "ipv4" => "：属性は有効なIPv4アドレスである必要があります。",
    "ipv6" => "：属性は有効なIPv6アドレスである必要があります。",
    "json" => "：属性は有効なJSON文字列でなければなりません。",
    "lt" => [
        "numeric" => "：属性は次のことよりも少ない必要があります。",
        "file" => "：属性は次のとおりでなければなりません：値kilobytes。",
        "string" => "：属性は以下よりも少ない必要があります。値文字。",
        "array" => "：属性は次のものよりも少ない必要があります。値アイテム。"
    ],
    "lte" => [
        "numeric" => "：属性は次のこと以下でなければなりません：値。",
        "file" => "：属性はより低いまたは等しくなければなりません：値キロバイト。",
        "string" => "：属性は、値以下でなければなりません：値文字。",
        "array" => "：属性は以下を超えてはなりません。値アイテム。"
    ],
    "max" => [
        "numeric" => "：属性は以下より大きくない場合があります。",
        "file" => "：属性は次のとおりではない場合があります：max kilobytes。",
        "string" => "：属性は次のようになりません：最大文字。",
        "array" => "：属性には以下を超えていない場合があります。"
    ],
    "mimes" => "：属性はタイプのファイルである必要があります：：値。",
    "mimetypes" => "：属性はタイプのファイルである必要があります：：値。",
    "min" => [
        "numeric" => "：属性は少なくとも：minでなければなりません。",
        "file" => "：属性は少なくとも：min kilobytesでなければなりません。",
        "string" => "：属性は少なくとも：最小文字でなければなりません。",
        "array" => "：属性には少なくとも：最小アイテムが必要です。"
    ],
    "not_in" => "選択された：属性は無効です。",
    "not_regex" => "：属性形式は無効です。",
    "numeric" => "：属性は数字でなければなりません。",
    "password" => "パスワードが正しくありません。",
    "present" => "：属性フィールドが存在する必要があります。",
    "regex" => "：属性形式は無効です。",
    "required" => "：属性フィールドが必要です。",
    "required_if" => "：属性フィールドは、次の場合に必要です：value。",
    "required_unless" => "：属性フィールドは次のとおりでない限り必要です。",
    "required_with" => "：値が存在する場合、属性フィールドが必要です。",
    "required_with_all" => "：値が存在する場合、属性フィールドが必要です。",
    "required_without" => "：値が存在しない場合、属性フィールドが必要です。",
    "required_without_all" => "：属性フィールドは、値が存在しない場合に必要です。",
    "same" => "：属性と：その他は一致する必要があります。",
    "size" => [
        "numeric" => "：属性は次のようにする必要があります。",
        "file" => "：属性は次のようにする必要があります：サイズキロバイト。",
        "string" => "：属性は次のようにする必要があります。サイズ文字。",
        "array" => "：属性には以下を含める必要があります。サイズアイテム。"
    ],
    "starts_with" => "：属性は次のいずれかで開始する必要があります。",
    "string" => "：属性は文字列でなければなりません。",
    "timezone" => "：属性は有効なゾーンでなければなりません。",
    "unique" => "：属性はすでに取得されています。",
    "uploaded" => "：属性はアップロードに失敗しました。",
    "url" => "：属性形式は無効です。",
    "uuid" => "：属性は有効なUUIDでなければなりません。",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "カスタムメッセージ"
        ]
    ],
    "attributes" => []
];
