<?php

$jayParsedAry = [
    "accepted" => "ต้องยอมรับแอตทริบิวต์:",
    "active_url" => ": แอตทริบิวต์ไม่ใช่ URL ที่ถูกต้อง",
    "after" => "แอตทริบิวต์: ต้องเป็นวันที่หลังจากวันที่",
    "after_or_equal" => "แอตทริบิวต์: ต้องเป็นวันที่หลังจากหรือเท่ากับ: วันที่",
    "alpha" => "แอตทริบิวต์: อาจมีตัวอักษรเท่านั้น",
    "alpha_dash" => "แอตทริบิวต์: อาจมีเพียงตัวอักษรตัวเลขขีดเส้นขีดและขีดเส้นใต้เท่านั้น",
    "alpha_num" => "แอตทริบิวต์: อาจมีตัวอักษรและตัวเลขเท่านั้น",
    "array" => "แอตทริบิวต์: ต้องเป็นอาร์เรย์",
    "before" => "แอตทริบิวต์: ต้องเป็นวันที่ก่อน: วันที่",
    "before_or_equal" => "แอตทริบิวต์: ต้องเป็นวันที่ก่อนหรือเท่ากับ: วันที่",
    "between" => [
        "numeric" => ": แอตทริบิวต์ต้องอยู่ระหว่าง: ขั้นต่ำและ: สูงสุด",
        "file" => ": แอตทริบิวต์ต้องอยู่ระหว่าง: ขั้นต่ำและ: สูงสุดกิโลไบต์",
        "string" => "แอตทริบิวต์: ต้องอยู่ระหว่าง: min และ: ตัวอักษรสูงสุด",
        "array" => ": แอตทริบิวต์ต้องมีระหว่าง: min และ: รายการสูงสุด"
    ],
    "boolean" => "ฟิลด์แอตทริบิวต์: จะต้องเป็นจริงหรือเท็จ",
    "confirmed" => ": การยืนยันแอตทริบิวต์ไม่ตรงกัน",
    "date" => ": แอตทริบิวต์ไม่ใช่วันที่ที่ถูกต้อง",
    "date_equals" => "แอตทริบิวต์: ต้องเป็นวันที่เท่ากับ: วันที่",
    "date_format" => ": แอตทริบิวต์ไม่ตรงกับรูปแบบ: รูปแบบ",
    "different" => ": แอตทริบิวต์และ: อื่น ๆ ต้องแตกต่างกัน",
    "digits" => ": แอตทริบิวต์ต้องเป็นตัวเลขตัวเลข",
    "digits_between" => ": แอตทริบิวต์ต้องอยู่ระหว่าง: ขั้นต่ำและ: หลักสูงสุด",
    "dimensions" => ": แอตทริบิวต์มีขนาดภาพที่ไม่ถูกต้อง",
    "distinct" => "ฟิลด์แอตทริบิวต์: มีค่าที่ซ้ำกัน",
    "email" => "แอตทริบิวต์: ต้องเป็นที่อยู่อีเมลที่ถูกต้อง",
    "ends_with" => "แอตทริบิวต์: ต้องจบลงด้วยหนึ่งในสิ่งต่อไปนี้ :: ค่า",
    "exists" => "แอตทริบิวต์ที่เลือก: ไม่ถูกต้อง",
    "file" => ": แอตทริบิวต์ต้องเป็นไฟล์",
    "filled" => "ฟิลด์แอตทริบิวต์: ต้องมีค่า",
    "gt" => [
        "numeric" => ": แอตทริบิวต์ต้องมากกว่า: ค่า",
        "file" => ": แอตทริบิวต์ต้องมากกว่า: ค่ากิโลไบต์",
        "string" => "แอตทริบิวต์: ต้องมากกว่า: อักขระค่า",
        "array" => "แอตทริบิวต์: ต้องมีมากกว่า: รายการค่า"
    ],
    "gte" => [
        "numeric" => ": แอตทริบิวต์ต้องมากกว่าหรือเท่ากัน: ค่า",
        "file" => "แอตทริบิวต์: ต้องมีค่ามากกว่าหรือเท่าเทียมกัน: ค่ากิโลไบต์",
        "string" => "แอตทริบิวต์: ต้องมากกว่าหรือเท่ากัน: อักขระค่า",
        "array" => ": แอตทริบิวต์ต้องมี: รายการค่าหรือมากกว่า"
    ],
    "image" => ": แอตทริบิวต์ต้องเป็นภาพ",
    "in" => "แอตทริบิวต์ที่เลือก: ไม่ถูกต้อง",
    "in_array" => "ฟิลด์แอตทริบิวต์: ไม่มีอยู่ใน: อื่น ๆ",
    "integer" => ": แอตทริบิวต์ต้องเป็นจำนวนเต็ม",
    "ip" => ": แอตทริบิวต์ต้องเป็นที่อยู่ IP ที่ถูกต้อง",
    "ipv4" => ": แอตทริบิวต์ต้องเป็นที่อยู่ IPv4 ที่ถูกต้อง",
    "ipv6" => "แอตทริบิวต์: ต้องเป็นที่อยู่ IPv6 ที่ถูกต้อง",
    "json" => "แอตทริบิวต์: ต้องเป็นสตริง JSON ที่ถูกต้อง",
    "lt" => [
        "numeric" => ": แอตทริบิวต์ต้องน้อยกว่า: ค่า",
        "file" => "แอตทริบิวต์: ต้องน้อยกว่า: ค่ากิโลไบต์",
        "string" => "แอตทริบิวต์: ต้องน้อยกว่า: อักขระค่า",
        "array" => ": แอตทริบิวต์ต้องมีน้อยกว่า: รายการค่า"
    ],
    "lte" => [
        "numeric" => "แอตทริบิวต์: ต้องน้อยกว่าหรือเท่ากับ: ค่า",
        "file" => "แอตทริบิวต์: ต้องน้อยกว่าหรือเท่ากับ: ค่ากิโลไบต์",
        "string" => "แอตทริบิวต์: ต้องน้อยกว่าหรือเท่ากับ: อักขระค่า",
        "array" => "แอตทริบิวต์: ต้องมีไม่เกิน: รายการค่า"
    ],
    "max" => [
        "numeric" => "แอตทริบิวต์: อาจไม่มากกว่า: สูงสุด",
        "file" => ": แอตทริบิวต์อาจไม่มากกว่า: สูงสุดกิโลไบต์",
        "string" => "แอตทริบิวต์: อาจไม่มากกว่า: อักขระสูงสุด",
        "array" => "แอตทริบิวต์: อาจไม่มีมากกว่า: รายการสูงสุด"
    ],
    "mimes" => "แอตทริบิวต์: ต้องเป็นไฟล์ประเภท:: ค่า",
    "mimetypes" => "แอตทริบิวต์: ต้องเป็นไฟล์ประเภท:: ค่า",
    "min" => [
        "numeric" => "แอตทริบิวต์: อย่างน้อยที่สุด: นาที",
        "file" => "แอตทริบิวต์: อย่างน้อยที่สุด: นาทีกิโลไบต์",
        "string" => "แอตทริบิวต์: อย่างน้อย: อักขระมิน",
        "array" => ": แอตทริบิวต์ต้องมีอย่างน้อย: รายการขั้นต่ำ"
    ],
    "not_in" => "แอตทริบิวต์ที่เลือก: ไม่ถูกต้อง",
    "not_regex" => "รูปแบบแอตทริบิวต์ไม่ถูกต้อง",
    "numeric" => ": แอตทริบิวต์ต้องเป็นตัวเลข",
    "password" => "รหัสผ่านไม่ถูกต้อง",
    "present" => "ต้องมีฟิลด์แอตทริบิวต์:",
    "regex" => "รูปแบบแอตทริบิวต์ไม่ถูกต้อง",
    "required" => "ต้องใช้ฟิลด์แอตทริบิวต์:",
    "required_if" => ": ต้องการฟิลด์แอตทริบิวต์: อื่น ๆ : อื่น ๆ คือ: ค่า",
    "required_unless" => ": ต้องการฟิลด์แอตทริบิวต์เว้นแต่ว่า: อื่น ๆ อยู่ใน: ค่า",
    "required_with" => ": จำเป็นต้องมีฟิลด์แอตทริบิวต์: มีค่า: มีอยู่",
    "required_with_all" => ": จำเป็นต้องมีฟิลด์แอตทริบิวต์: มีค่า: มีอยู่",
    "required_without" => ": ต้องการฟิลด์แอตทริบิวต์เมื่อ: ไม่มีค่า",
    "required_without_all" => ": ต้องการฟิลด์แอตทริบิวต์: ไม่มีค่า: มีอยู่",
    "same" => ": แอตทริบิวต์และ: อื่น ๆ ต้องตรงกัน",
    "size" => [
        "numeric" => ": แอตทริบิวต์ต้องมี: ขนาด",
        "file" => ": แอตทริบิวต์ต้องเป็น: ขนาดกิโลไบต์",
        "string" => ": แอตทริบิวต์ต้องเป็น: อักขระขนาด",
        "array" => ": แอตทริบิวต์ต้องมี: รายการขนาด"
    ],
    "starts_with" => "แอตทริบิวต์: ต้องเริ่มต้นด้วยหนึ่งในสิ่งต่อไปนี้ :: ค่า",
    "string" => ": แอตทริบิวต์ต้องเป็นสตริง",
    "timezone" => ": แอตทริบิวต์ต้องเป็นโซนที่ถูกต้อง",
    "unique" => ": แอตทริบิวต์ได้ถูกนำมาใช้แล้ว",
    "uploaded" => "แอตทริบิวต์: ไม่สามารถอัปโหลดได้",
    "url" => "รูปแบบแอตทริบิวต์ไม่ถูกต้อง",
    "uuid" => ": แอตทริบิวต์ต้องเป็น UUID ที่ถูกต้อง",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "ข้อความที่กำหนดเอง"
        ]
    ],
    "attributes" => []
];
