<?php

$jayParsedAry = [
    "accepted" => "එම: ගුණාංගය පිළිගත යුතුය.",
    "active_url" => "පිළිතුර: ගුණාංගය වලංගු URL එකක් නොවේ.",
    "after" => "The: ගුණාංගය පසු දිනක් විය යුතුය: දිනය.",
    "after_or_equal" => "The: ගුණාංගය පසු හෝ සමාන විය යුතුය: දිනය.",
    "alpha" => "පිළිතුර: ගුණාංගය අඩංගු විය හැක්කේ අකුරු පමණි.",
    "alpha_dash" => "පිළිතුර: ගුණාංගය අඩංගු විය හැක්කේ අකුරු, අංක, ඉස් සහ ආතතිය පමණි.",
    "alpha_num" => "පිළිතුර: ගුණාංගය අඩංගු විය හැක්කේ අකුරු සහ සංඛ්යා පමණි.",
    "array" => "පිළිතුර: ගුණාංගය අරාවක් විය යුතුය.",
    "before" => "The: ගුණාංගය මීට පෙර දිනය විය යුතුය: දිනය.",
    "before_or_equal" => "The: ගුණාංගය: දිනය.",
    "between" => [
        "numeric" => "Th: ගුණාංගය අතර විය යුතුය: min සහ: උපරිම.",
        "file" => "THE: ගුණාංගය අතර විය යුතුය: min සහ: උපරිම කිලෝග්රෑම්.",
        "string" => "THE: ගුණාංගය අතර විය යුතුය: min සහ: උපරිම අක්ෂර.",
        "array" => "Th: ගුණාංගය අතර තිබිය යුතුය: min සහ: උපරිම අයිතම."
    ],
    "boolean" => "The: ආරෝපණ ක්ෂේත්රය සත්ය හෝ අසත්ය විය යුතුය.",
    "confirmed" => ": ආරෝපණ තහවුරු කිරීම නොගැලපේ.",
    "date" => "The: ගුණාංගය වලංගු දිනයක් නොවේ.",
    "date_equals" => "Th: ගුණාංගය සමාන දිනයක් විය යුතුය: දිනය.",
    "date_format" => "The: ගුණාංගය ආකෘතියට නොගැලපේ: ආකෘතිය.",
    "different" => "එම: ගුණාංගය සහ: වෙනත් ඒවා වෙනස් විය යුතුය.",
    "digits" => "THE: ගුණාංගය විය යුතුය: ඉලක්කම් ඉලක්කම්.",
    "digits_between" => "THE: ගුණාංගය අතර විය යුතුය: min සහ: උපරිම ඉලක්කම්.",
    "dimensions" => "The: ගුණාංගය අවලංගු රූප මානයන් ඇත.",
    "distinct" => ": ආරෝපණ ක්ෂේත්රයේ අනුපිටපතක් ඇත.",
    "email" => "මෙම: ගුණාංගය වලංගු විද්යුත් තැපැල් ලිපිනයක් විය යුතුය.",
    "ends_with" => ":: ගුණාංගය පහත සඳහන් දේවලින් අවසන් විය යුතුය:: අගයන්.",
    "exists" => "තෝරාගත්: ගුණාංගය අවලංගුය.",
    "file" => ": ගුණාංගය ගොනුවක් විය යුතුය.",
    "filled" => "The: ආරෝපණ ක්ෂේත්රයට වටිනාකමක් තිබිය යුතුය.",
    "gt" => [
        "numeric" => "පිළිතුර: ගුණාංගය වඩා වැඩි විය යුතුය: වටිනාකම.",
        "file" => "THE: ගුණාංගය වඩා වැඩි විය යුතුය: වටිනාකමින් යුත් කිලෝබයිට්ස්.",
        "string" => "THE: ගුණාංගය වඩා වැඩි විය යුතුය: අගය අක්ෂර.",
        "array" => "The: ගුණාංගයට වඩා වැඩි ප්රමාණයක් තිබිය යුතුය: අගය අයිතම."
    ],
    "gte" => [
        "numeric" => "THE: ගුණාංගය වැඩි හෝ සමාන විය යුතුය: අගය.",
        "file" => "The: ගුණාංගය වැඩි හෝ සමාන විය යුතුය: වටිනාකමින් යුත් කිලෝබයිට්ස්.",
        "string" => "වර්ගය: ගුණාංගය වඩා වැඩි හෝ සමාන විය යුතුය: අගය අක්ෂර.",
        "array" => "The: ගුණාංගය තිබිය යුතුය: අගය අයිතම හෝ ඊට වැඩි."
    ],
    "image" => "පිළිතුර: ගුණාංගය රූපයක් විය යුතුය.",
    "in" => "තෝරාගත්: ගුණාංගය අවලංගුය.",
    "in_array" => ": ආරෝපණ ක්ෂේත්රය නොපවතී: වෙනත්.",
    "integer" => ": ගුණාංගය පූර්ණ සංඛ්යාවක් විය යුතුය.",
    "ip" => "THE: ගුණාංගය වලංගු IP ලිපිනයක් විය යුතුය.",
    "ipv4" => "THE: ගුණාංගය වලංගු IPv4 ලිපිනයක් විය යුතුය.",
    "ipv6" => "THE: ගුණාංගය වලංගු IPv6 ලිපිනයක් විය යුතුය.",
    "json" => "The: ගුණාංගය වලංගු JSON නූලක් විය යුතුය.",
    "lt" => [
        "numeric" => "THE: ගුණාංගය වඩා අඩු විය යුතුය: වටිනාකම.",
        "file" => "The: ගුණාංගය: වටිනාකමින් යුත් කිලෝබයිට්ස් අඩු විය යුතුය.",
        "string" => "The: ගුණාංගය වඩා අඩු විය යුතුය: අගය අක්ෂර.",
        "array" => "The: ගුණාංගය: වටිනාකම් සහිත අයිතම වලට වඩා අඩු විය යුතුය."
    ],
    "lte" => [
        "numeric" => "වර්ගය: ගුණාංගය අඩු හෝ සමාන විය යුතුය: අගය.",
        "file" => "මෙම: ගුණාංගය අඩු හෝ සමාන විය යුතුය: අගය කිලෝබයිට්ස්.",
        "string" => "වර්ගය: ගුණාංගය අඩු හෝ සමාන විය යුතුය: අගය අක්ෂර.",
        "array" => "The: ගුණාංගයට වඩා වැඩි ප්රමාණයක් නොතිබිය යුතුය: අගය අයිතම."
    ],
    "max" => [
        "numeric" => "THE: ගුණාංගය වඩා වැඩි නොවිය හැකිය: මැක්ස්.",
        "file" => ":: ගුණාංගය: මැක්ස් කිලෝබයිට් වලට වඩා වැඩි නොවිය හැකිය.",
        "string" => "THE: ගුණාංගය: උපරිම අක්ෂර වලට වඩා වැඩි නොවිය හැකිය.",
        "array" => "The: ගුණාංගය: මැක්ස් අයිතම වලට වඩා වැඩි ගණනක් නොතිබිය හැකිය."
    ],
    "mimes" => "වර්ගය: ගුණාංගය වර්ගයේ ගොනුවක් විය යුතුය: අගයන්.",
    "mimetypes" => "වර්ගය: ගුණාංගය වර්ගයේ ගොනුවක් විය යුතුය: අගයන්.",
    "min" => [
        "numeric" => "THE: ගුණාංගය අවම වශයෙන් විය යුතුය: අවම.",
        "file" => "මෙම: ගුණාංගය අවම වශයෙන්: අවම කිලෝබයිට්ස්.",
        "string" => "The: ගුණාංගය අවම වශයෙන්: අවම අක්ෂර.",
        "array" => "The: ගුණාංගය අවම වශයෙන් තිබිය යුතුය: අවම අයිතම."
    ],
    "not_in" => "තෝරාගත්: ගුණාංගය අවලංගුය.",
    "not_regex" => "The: ආරෝපණ ආකෘතිය අවලංගුය.",
    "numeric" => "පිළිතුර: ගුණාංගය අංකයක් විය යුතුය.",
    "password" => "මුරපදය වැරදිය.",
    "present" => ": ආරෝපණ ක්ෂේත්රය පැමිණ සිටිය යුතුය.",
    "regex" => "The: ආරෝපණ ආකෘතිය අවලංගුය.",
    "required" => ": ආරෝපණ ක්ෂේත්රය අවශ්ය වේ.",
    "required_if" => "THE: ගුණාංග ක්ෂේත්රය අවශ්ය වන්නේ: වෙනත් දෙය: අගය.",
    "required_unless" => ":: වෙනත් අයගේ: සාරධර්ම තිබේ නම්: ගුණාංග ක්ෂේත්රය අවශ්ය වේ.",
    "required_with" => "THE: ආරෝපණ ක්ෂේත්රය අවශ්ය වන්නේ කවදාද: සාරධර්ම තිබේ.",
    "required_with_all" => "THE: ගුණාංග ක්ෂේත්රය අවශ්ය වන්නේ කවදාද: සාරධර්ම තිබේ.",
    "required_without" => "THE: ගුණාංග ක්ෂේත්රය අවශ්ය වන්නේ: සාරධර්ම නොමැත.",
    "required_without_all" => ":: අගයන් නොමැති විට: ආරෝපණ ක්ෂේත්රය අවශ්ය වේ.",
    "same" => "මෙම: ගුණාංගය සහ: වෙනත් නොගැලපේ.",
    "size" => [
        "numeric" => "THE: ගුණාංගය විය යුතුය: ප්රමාණය.",
        "file" => "THE: ගුණාංගය විය යුත්තේ: ප්රමාණය කිලෝවිට්ස්.",
        "string" => "THE: ගුණාංගය විය යුතුය: ප්රමාණයේ අක්ෂර.",
        "array" => "The: ගුණාංගය අඩංගු විය යුතුය: ප්රමාණයේ අයිතම."
    ],
    "starts_with" => "The: ගුණාංගය පහත සඳහන් දේවලින් ආරම්භ විය යුතුය:: අගයන්.",
    "string" => ": ගුණාංගය නූලක් විය යුතුය.",
    "timezone" => "The: ගුණාංගය වලංගු කලාපයක් විය යුතුය.",
    "unique" => ": ගුණාංගය දැනටමත් ගෙන ඇත.",
    "uploaded" => "The: ගුණාංගය උඩුගත කිරීමට අසමත් විය.",
    "url" => "The: ආරෝපණ ආකෘතිය අවලංගුය.",
    "uuid" => "The: ගුණාංගය වලංගු UUID විය යුතුය.",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "අභිරුචි-පණිවිඩය"
        ]
    ],
    "attributes" => []
];
