<?php

return [
    "accepted" => "يجب قبول السمة.",
    "active_url" => ": السمة ليست عنوان URL صالح.",
    "after" => "يجب أن تكون السمة تاريخًا بعد: التاريخ.",
    "after_or_equal" => "يجب أن تكون السمة تاريخًا بعد أو تساوي: التاريخ.",
    "alpha" => "قد تحتوي السمة على رسائل فقط.",
    "alpha_dash" => "قد تحتوي السمة: فقط على رسائل وأرقام وشرطات وترسيح.",
    "alpha_num" => "قد تحتوي السمة على رسائل وأرقام فقط.",
    "array" => "يجب أن تكون السمة صفيفًا.",
    "before" => "يجب أن تكون السمة تاريخًا سابقًا: التاريخ.",
    "before_or_equal" => "يجب أن تكون السمة تاريخًا قبل أو يساوي: التاريخ.",
    "between" => [
        "numeric" => "يجب أن تكون السمة بين: Min و: Max.",
        "file" => "يجب أن تكون السمة بين: Min و: Max Kilobytes.",
        "string" => "يجب أن تكون السمة بين: min و: أقصى أحرف.",
        "array" => "يجب أن يكون: السمة بين: min و: max العناصر."
    ],
    "boolean" => "يجب أن يكون حقل السمة صحيحًا أو خطأ.",
    "confirmed" => ": تأكيد السمة لا يتطابق.",
    "date" => "السمة: ليست تاريخ صالح.",
    "date_equals" => "يجب أن يكون السمة تاريخًا يساوي: التاريخ.",
    "date_format" => "السمة لا تتطابق مع التنسيق: التنسيق.",
    "different" => "The: السمة و: الأخرى يجب أن تكون مختلفة.",
    "digits" => "يجب أن تكون السمة: أرقام الأرقام.",
    "digits_between" => "يجب أن تكون السمة بين: Min و: Max Digits.",
    "dimensions" => "السمة لها أبعاد صورة غير صالحة.",
    "distinct" => "حقل السمة: له قيمة مكررة.",
    "email" => "يجب أن تكون السمة عنوان بريد إلكتروني صالح.",
    "ends_with" => "يجب أن تنتهي السمة بأحد ما يلي:: القيم.",
    "exists" => "المحدد: السمة غير صالحة.",
    "file" => "يجب أن تكون السمة ملفًا.",
    "filled" => "يجب أن يكون لحقل السمة قيمة.",
    "gt" => [
        "numeric" => "يجب أن تكون السمة أكبر من: القيمة.",
        "file" => "يجب أن تكون السمة أكبر من: قيمة كيلوبايت.",
        "string" => "يجب أن تكون السمة أكبر من: أحرف القيمة.",
        "array" => "يجب أن تحتوي السمة على أكثر من: عناصر القيمة."
    ],
    "gte" => [
        "numeric" => "يجب أن تكون السمة أكبر من أو متساوية: القيمة.",
        "file" => "يجب أن تكون السمة أكبر من أو متساوية: كيلوبايت القيمة.",
        "string" => "يجب أن تكون السمة أكبر من أو متساوية: أحرف القيمة.",
        "array" => "يجب أن يكون لدى السمة: عناصر القيمة أو أكثر."
    ],
    "image" => "يجب أن تكون السمة صورة.",
    "in" => "المحدد: السمة غير صالحة.",
    "in_array" => ": حقل السمة غير موجود في: آخر.",
    "integer" => "يجب أن تكون السمة عددًا صحيحًا.",
    "ip" => "يجب أن تكون السمة عنوان IP صالحًا.",
    "ipv4" => "يجب أن تكون السمة عنوان IPv4 صالح.",
    "ipv6" => "يجب أن تكون السمة عنوان IPv6 صالح.",
    "json" => "يجب أن تكون السمة سلسلة JSON صالحة.",
    "lt" => [
        "numeric" => "يجب أن تكون السمة أقل من: القيمة.",
        "file" => "يجب أن تكون السمة أقل من: قيمة الكيلوغرام.",
        "string" => "يجب أن تكون السمة أقل من: أحرف القيمة.",
        "array" => "يجب أن تحتوي السمة على أقل من: عناصر القيمة."
    ],
    "lte" => [
        "numeric" => "يجب أن تكون السمة أقل من أو متساوية: القيمة.",
        "file" => "يجب أن تكون السمة أقل من أو متساوية: قيمة كيلو بايت.",
        "string" => "يجب أن تكون السمة أقل من أو متساوية: أحرف القيمة.",
        "array" => "يجب ألا تحتوي السمة على أكثر من: عناصر القيمة."
    ],
    "max" => [
        "numeric" => "قد لا تكون السمة أكبر من: Max.",
        "file" => "قد لا تكون السمة أكبر من: الحد الأقصى كيلوبايت.",
        "string" => "قد لا تكون السمة أكبر من: أقصى أحرف.",
        "array" => "قد لا تحتوي السمة على أكثر من: Max head."
    ],
    "mimes" => "يجب أن تكون السمة ملف من النوع :: قيم.",
    "mimetypes" => "يجب أن تكون السمة ملف من النوع :: قيم.",
    "min" => [
        "numeric" => "يجب أن تكون السمة على الأقل: دقيقة.",
        "file" => "يجب أن تكون السمة على الأقل: دقيقة كيلوبايت.",
        "string" => "يجب أن تكون السمة على الأقل: أحرف دقيقة.",
        "array" => "يجب أن يكون السمة: العناصر دقيقة على الأقل."
    ],
    "not_in" => "المحدد: السمة غير صالحة.",
    "not_regex" => ": تنسيق السمة غير صالح.",
    "numeric" => "يجب أن تكون السمة رقمًا.",
    "password" => "كلمة المرور غير صحيحة.",
    "present" => "يجب أن يكون حقل السمة موجودًا.",
    "regex" => ": تنسيق السمة غير صالح.",
    "required" => "مطلوب: حقل السمة.",
    "required_if" => "الحقل: حقل السمة مطلوب عندما: الآخر هو: القيمة.",
    "required_unless" => "مطلوب حقل السمة ما لم يكن: الآخر في: القيم.",
    "required_with" => "حقل السمة مطلوب عندما: القيم موجودة.",
    "required_with_all" => "حقل السمة مطلوب عندما: القيم موجودة.",
    "required_without" => ": حقل السمة مطلوب عندما: القيم غير موجودة.",
    "required_without_all" => "حقل السمة مطلوب عندما لا يوجد أي من: القيم موجودة.",
    "same" => "The: السمة و: الآخر يجب أن يتطابق.",
    "size" => [
        "numeric" => "يجب أن تكون السمة: الحجم.",
        "file" => "يجب أن تكون السمة: حجم كيلوبايت.",
        "string" => "يجب أن تكون السمة: أحرف الحجم.",
        "array" => "يجب أن تحتوي السمة على: عناصر الحجم."
    ],
    "starts_with" => "يجب أن تبدأ السمة بواحدة مما يلي:: القيم.",
    "string" => "يجب أن تكون السمة سلسلة.",
    "timezone" => "يجب أن تكون السمة منطقة صالحة.",
    "unique" => "السمة قد أخذت بالفعل.",
    "uploaded" => "فشل: السمة في التحميل.",
    "url" => ": تنسيق السمة غير صالح.",
    "uuid" => "يجب أن تكون السمة uuid صالحة.",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "الترتيب المخصص"
        ]
    ],
    "attributes" => []
];
