<?php

return [
    "accepted" => "தி: பண்புக்கூறு ஏற்றுக்கொள்ளப்பட வேண்டும்.",
    "active_url" => "தி: பண்புக்கூறு சரியான URL அல்ல.",
    "after" => "தி: பண்புக்கூறு ஒரு தேதியாக இருக்க வேண்டும்: தேதி.",
    "after_or_equal" => "தி: பண்புக்கூறு ஒரு தேதியாக அல்லது அதற்கு சமமாக இருக்க வேண்டும்: தேதி.",
    "alpha" => "தி: பண்புக்கூறில் கடிதங்கள் மட்டுமே இருக்கலாம்.",
    "alpha_dash" => "தி: பண்புக்கூறில் கடிதங்கள், எண்கள், கோடுகள் மற்றும் அடிக்கோடிட்டுக் காட்டுதல் மட்டுமே இருக்கலாம்.",
    "alpha_num" => "தி: பண்புக்கூறில் கடிதங்கள் மற்றும் எண்கள் மட்டுமே இருக்கலாம்.",
    "array" => "தி: பண்புக்கூறு ஒரு வரிசையாக இருக்க வேண்டும்.",
    "before" => "தி: பண்புக்கூறு முந்தைய தேதியாக இருக்க வேண்டும்: தேதி.",
    "before_or_equal" => "தி: பண்புக்கூறு ஒரு தேதியாக இருக்க வேண்டும் அல்லது அதற்கு சமமானதாக இருக்க வேண்டும்: தேதி.",
    "between" => [
        "numeric" => "தி: பண்புக்கூறு இடையில் இருக்க வேண்டும்: நிமிடம் மற்றும்: அதிகபட்சம்.",
        "file" => "தி: பண்புக்கூறு இடையில் இருக்க வேண்டும்: நிமிடம் மற்றும்: அதிகபட்ச கிலோபைட்டுகள்.",
        "string" => "தி: பண்புக்கூறு இடையில் இருக்க வேண்டும்: நிமிடம் மற்றும்: அதிகபட்ச எழுத்துக்கள்.",
        "array" => "தி: பண்புக்கூறு இடையில் இருக்க வேண்டும்: நிமிடம் மற்றும்: அதிகபட்ச உருப்படிகள்."
    ],
    "boolean" => "தி: பண்புக்கூறு புலம் உண்மையாகவோ அல்லது பொய்யாகவோ இருக்க வேண்டும்.",
    "confirmed" => "தி: பண்புக்கூறு உறுதிப்படுத்தல் பொருந்தவில்லை.",
    "date" => "தி: பண்புக்கூறு சரியான தேதி அல்ல.",
    "date_equals" => "The: பண்புக்கூறு சமமான தேதியாக இருக்க வேண்டும்: தேதி.",
    "date_format" => "தி: பண்புக்கூறு வடிவத்துடன் பொருந்தவில்லை: வடிவம்.",
    "different" => "தி: பண்புக்கூறு மற்றும்: மற்றவை வித்தியாசமாக இருக்க வேண்டும்.",
    "digits" => "தி: பண்புக்கூறு இருக்க வேண்டும்: இலக்கங்கள் இலக்கங்கள்.",
    "digits_between" => "தி: பண்புக்கூறு இடையில் இருக்க வேண்டும்: நிமிடம் மற்றும்: அதிகபட்ச இலக்கங்கள்.",
    "dimensions" => "தி: பண்புக்கூறு தவறான பட பரிமாணங்களைக் கொண்டுள்ளது.",
    "distinct" => "தி: பண்புக்கூறு புலம் நகல் மதிப்பைக் கொண்டுள்ளது.",
    "email" => "தி: பண்புக்கூறு சரியான மின்னஞ்சல் முகவரியாக இருக்க வேண்டும்.",
    "ends_with" => "தி: பண்புக்கூறு பின்வருவனவற்றில் முடிவடையும் :: மதிப்புகள்.",
    "exists" => "தேர்ந்தெடுக்கப்பட்ட: பண்புக்கூறு தவறானது.",
    "file" => "தி: பண்புக்கூறு ஒரு கோப்பாக இருக்க வேண்டும்.",
    "filled" => "தி: பண்புக்கூறு புலத்திற்கு ஒரு மதிப்பு இருக்க வேண்டும்.",
    "gt" => [
        "numeric" => "The: பண்புக்கூறு அதிகமாக இருக்க வேண்டும்: மதிப்பு.",
        "file" => "The: பண்புக்கூறு அதிகமாக இருக்க வேண்டும்: மதிப்பு கிலோபைட்டுகள்.",
        "string" => "The: பண்புக்கூறு அதிகமாக இருக்க வேண்டும்: மதிப்பு எழுத்துக்கள்.",
        "array" => "The: பண்புக்கூறு அதிகமாக இருக்க வேண்டும்: மதிப்பு உருப்படிகள்."
    ],
    "gte" => [
        "numeric" => "தி: பண்புக்கூறு அதிகமாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்: மதிப்பு.",
        "file" => "தி: பண்புக்கூறு அதிகமாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்: மதிப்பு கிலோபைட்டுகள்.",
        "string" => "தி: பண்புக்கூறு அதிகமாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்: மதிப்பு எழுத்துக்கள்.",
        "array" => "தி: பண்புக்கூறு இருக்க வேண்டும்: மதிப்பு உருப்படிகள் அல்லது அதற்கு மேற்பட்டவை."
    ],
    "image" => "தி: பண்புக்கூறு ஒரு படமாக இருக்க வேண்டும்.",
    "in" => "தேர்ந்தெடுக்கப்பட்ட: பண்புக்கூறு தவறானது.",
    "in_array" => "தி: பண்புக்கூறு புலம் இதில் இல்லை: மற்றவை.",
    "integer" => "தி: பண்புக்கூறு ஒரு முழு எண்ணாக இருக்க வேண்டும்.",
    "ip" => "தி: பண்புக்கூறு சரியான ஐபி முகவரியாக இருக்க வேண்டும்.",
    "ipv4" => "தி: பண்புக்கூறு சரியான ஐபிவி 4 முகவரியாக இருக்க வேண்டும்.",
    "ipv6" => "தி: பண்புக்கூறு சரியான ஐபிவி 6 முகவரியாக இருக்க வேண்டும்.",
    "json" => "தி: பண்புக்கூறு செல்லுபடியாகும் JSON சரம் இருக்க வேண்டும்.",
    "lt" => [
        "numeric" => "The: பண்புக்கூறு குறைவாக இருக்க வேண்டும்: மதிப்பு.",
        "file" => "தி: பண்புக்கூறு குறைவாக இருக்க வேண்டும்: மதிப்பு கிலோபைட்டுகள்.",
        "string" => "தி: பண்புக்கூறு குறைவாக இருக்க வேண்டும்: மதிப்பு எழுத்துக்கள்.",
        "array" => "தி: பண்புக்கூறு குறைவாக இருக்க வேண்டும்: மதிப்பு உருப்படிகள்."
    ],
    "lte" => [
        "numeric" => "தி: பண்புக்கூறு குறைவாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்: மதிப்பு.",
        "file" => "தி: பண்புக்கூறு குறைவாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்: மதிப்பு கிலோபைட்டுகள்.",
        "string" => "தி: பண்புக்கூறு குறைவாகவோ அல்லது சமமாகவோ இருக்க வேண்டும்: மதிப்பு எழுத்துக்கள்.",
        "array" => "The: பண்புக்கூறுகளை விட அதிகமாக இருக்கக்கூடாது: மதிப்பு உருப்படிகள்."
    ],
    "max" => [
        "numeric" => "தி: பண்புக்கூறு அதிகமாக இருக்காது: அதிகபட்சம்.",
        "file" => "தி: பண்புக்கூறு அதிகமாக இருக்காது: அதிகபட்ச கிலோபைட்டுகள்.",
        "string" => "தி: பண்புக்கூறு அதிகமாக இருக்காது: அதிகபட்ச எழுத்துக்கள்.",
        "array" => "தி: பண்புக்கூறு விட அதிகமாக இருக்காது: அதிகபட்ச உருப்படிகள்."
    ],
    "mimes" => "தி: பண்புக்கூறு வகையின் கோப்பாக இருக்க வேண்டும் :: மதிப்புகள்.",
    "mimetypes" => "தி: பண்புக்கூறு வகையின் கோப்பாக இருக்க வேண்டும் :: மதிப்புகள்.",
    "min" => [
        "numeric" => "தி: பண்புக்கூறு குறைந்தபட்சம் இருக்க வேண்டும்: நிமிடம்.",
        "file" => "தி: பண்புக்கூறு குறைந்தபட்சம் இருக்க வேண்டும்: குறைந்தபட்ச கிலோபைட்டுகள்.",
        "string" => "தி: பண்புக்கூறு குறைந்தபட்சம் இருக்க வேண்டும்: குறைந்தபட்ச எழுத்துக்கள்.",
        "array" => "தி: பண்புக்கூறு குறைந்தபட்சம் இருக்க வேண்டும்: குறைந்தபட்ச உருப்படிகள்."
    ],
    "not_in" => "தேர்ந்தெடுக்கப்பட்ட: பண்புக்கூறு தவறானது.",
    "not_regex" => "தி: பண்புக்கூறு வடிவம் தவறானது.",
    "numeric" => "தி: பண்புக்கூறு ஒரு எண்ணாக இருக்க வேண்டும்.",
    "password" => "கடவுச்சொல் தவறானது.",
    "present" => "தி: பண்புக்கூறு புலம் இருக்க வேண்டும்.",
    "regex" => "தி: பண்புக்கூறு வடிவம் தவறானது.",
    "required" => "தி: பண்புக்கூறு புலம் தேவை.",
    "required_if" => "தி: பண்புக்கூறு புலம் எப்போது தேவைப்படுகிறது: மற்றவை: மதிப்பு.",
    "required_unless" => "The: பண்புக்கூறு புலம் தேவைப்படுகிறது: மற்றவை உள்ளன: மதிப்புகள்.",
    "required_with" => "தி: பண்புக்கூறு புலம் தேவைப்படும் போது: மதிப்புகள் இருக்கும்.",
    "required_with_all" => "தி: பண்புக்கூறு புலம் தேவைப்படும் போது: மதிப்புகள் இருக்கும்.",
    "required_without" => "THE: பண்புக்கூறு புலம் எப்போது தேவைப்படுகிறது: மதிப்புகள் இல்லை.",
    "required_without_all" => "எதுவும் இல்லை: மதிப்புகள் இல்லாதபோது பண்புக்கூறு புலம் தேவைப்படுகிறது.",
    "same" => "தி: பண்புக்கூறு மற்றும்: மற்றவை பொருந்த வேண்டும்.",
    "size" => [
        "numeric" => "தி: பண்புக்கூறு இருக்க வேண்டும்: அளவு.",
        "file" => "தி: பண்புக்கூறு இருக்க வேண்டும்: அளவு கிலோபைட்டுகள்.",
        "string" => "தி: பண்புக்கூறு இருக்க வேண்டும்: அளவு எழுத்துக்கள்.",
        "array" => "தி: பண்புக்கூறு இருக்க வேண்டும்: அளவு உருப்படிகள்."
    ],
    "starts_with" => "தி: பண்புக்கூறு பின்வருவனவற்றில் ஒன்றைத் தொடங்க வேண்டும் :: மதிப்புகள்.",
    "string" => "தி: பண்புக்கூறு ஒரு சரமாக இருக்க வேண்டும்.",
    "timezone" => "தி: பண்புக்கூறு சரியான மண்டலமாக இருக்க வேண்டும்.",
    "unique" => "தி: பண்புக்கூறு ஏற்கனவே எடுக்கப்பட்டுள்ளது.",
    "uploaded" => "தி: பண்புக்கூறு பதிவேற்றத் தவறிவிட்டது.",
    "url" => "தி: பண்புக்கூறு வடிவம் தவறானது.",
    "uuid" => "தி: பண்புக்கூறு செல்லுபடியாகும் UUID ஆக இருக்க வேண்டும்.",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "தனிப்பயன் செய்தி"
        ]
    ],
    "attributes" => []
];
