<?php

return [
    "accepted" => "יש לקבל את התכונה.",
    "active_url" => "התכונה אינה כתובת אתר תקפה.",
    "after" => "התכונה חייבת להיות תאריך אחרי: תאריך.",
    "after_or_equal" => "התכונה חייבת להיות תאריך אחרי או שווה ל: תאריך.",
    "alpha" => "התכונה עשויה להכיל רק אותיות.",
    "alpha_dash" => "התכונה עשויה להכיל רק אותיות, מספרים, מקפים ומדגישים.",
    "alpha_num" => "התכונה עשויה להכיל רק אותיות ומספרים.",
    "array" => "התכונה חייבת להיות מערך.",
    "before" => "התכונה חייבת להיות תאריך לפני: תאריך.",
    "before_or_equal" => "התכונה חייבת להיות תאריך לפני או שווה ל: תאריך.",
    "between" => [
        "numeric" => "התכונה חייבת להיות בין: דקה ל: מקסימום.",
        "file" => "התכונה חייבת להיות בין: דקה ל: מקסימום קילובייט.",
        "string" => "התכונה חייבת להיות בין: דקה ל: מקסימום תווים.",
        "array" => "התכונה חייבת להיות בין: דקה ל: פריטים מקסימליים."
    ],
    "boolean" => "שדה: שדה התכונה חייב להיות נכון או לא נכון.",
    "confirmed" => "האישור: אישור התכונות אינו תואם.",
    "date" => "התכונה אינה תאריך תקף.",
    "date_equals" => "התכונה חייבת להיות תאריך שווה ל: תאריך.",
    "date_format" => "התכונה: התכונה אינה תואמת את הפורמט: פורמט.",
    "different" => "התכונה ו: אחר חייבים להיות שונים.",
    "digits" => "התכונה חייבת להיות: ספרות ספרות.",
    "digits_between" => "התכונה חייבת להיות בין: דקה ל: ספרות מקסימאליות.",
    "dimensions" => "לתכונה יש מידות תמונה לא חוקיות.",
    "distinct" => "השדה: שדה התכונה בעל ערך כפול.",
    "email" => "התכונה חייבת להיות כתובת דוא\"ל תקפה.",
    "ends_with" => "התכונה חייבת להסתיים באחד מהדברים הבאים:: ערכים.",
    "exists" => "התכונה שנבחרה: לא חוקי.",
    "file" => "התכונה: חייבת להיות קובץ.",
    "filled" => "השדה: שדה התכונה חייב להיות בעל ערך.",
    "gt" => [
        "numeric" => "התכונה חייבת להיות גדולה מ: ערך.",
        "file" => "התכונה חייבת להיות גדולה יותר מ: ערך קילובייט.",
        "string" => "התכונה חייבת להיות גדולה מ-: תווי ערך.",
        "array" => "התכונה חייבת להיות יותר מ: פריטי ערך."
    ],
    "gte" => [
        "numeric" => "התכונה חייבת להיות גדולה או שווה: ערך.",
        "file" => "התכונה חייבת להיות גדולה או שווה: ערך קילובייט.",
        "string" => "התכונה חייבת להיות גדולה יותר או שווה: תווי ערך.",
        "array" => "התכונה חייבת להיות: פריטי ערך או יותר."
    ],
    "image" => "התכונה חייבת להיות תמונה.",
    "in" => "התכונה שנבחרה: לא חוקי.",
    "in_array" => "השדה: שדה התכונה אינו קיים ב: אחר.",
    "integer" => "התכונה חייבת להיות מספר שלם.",
    "ip" => "התכונה חייבת להיות כתובת IP תקפה.",
    "ipv4" => "התכונה חייבת להיות כתובת IPv4 תקפה.",
    "ipv6" => "התכונה חייבת להיות כתובת IPv6 תקפה.",
    "json" => "התכונה חייבת להיות מחרוזת JSON תקפה.",
    "lt" => [
        "numeric" => "התכונה חייבת להיות פחות מ: ערך.",
        "file" => "התכונה חייבת להיות פחות מ: ערך קילובייט.",
        "string" => "התכונה חייבת להיות פחות מ: תווי ערך.",
        "array" => "התכונה חייבת להיות פחות מ: פריטי ערך."
    ],
    "lte" => [
        "numeric" => "התכונה חייבת להיות פחותה או שווה: ערך.",
        "file" => "התכונה חייבת להיות פחות או שווה: ערך קילובייט.",
        "string" => "התכונה חייבת להיות פחותה או שווה: תווי ערך.",
        "array" => "התכונה אסור שיהיה יותר מ: פריטי ערך."
    ],
    "max" => [
        "numeric" => "התכונה עשויה לא להיות גדולה יותר מ: מקסימום.",
        "file" => "התכונה עשויה לא להיות גדולה יותר מ: מקסימום קילובייט.",
        "string" => "התכונה עשויה לא להיות גדולה יותר מ-: תווים מקסימליים.",
        "array" => "התכונה אולי אין יותר מ: פריטי מקסימום."
    ],
    "mimes" => "התכונה: חייבת להיות קובץ מסוג :: ערכים.",
    "mimetypes" => "התכונה: חייבת להיות קובץ מסוג :: ערכים.",
    "min" => [
        "numeric" => "התכונה חייבת להיות לפחות: דקה.",
        "file" => "התכונה חייבת להיות לפחות: קילובייט דקה.",
        "string" => "התכונה חייבת להיות לפחות: דמויות דקות.",
        "array" => "התכונה חייבת להיות לפחות: דקה פריטים."
    ],
    "not_in" => "התכונה שנבחרה: לא חוקי.",
    "not_regex" => "פורמט התכונה אינו חוקי.",
    "numeric" => "התכונה חייבת להיות מספר.",
    "password" => "הסיסמה שגויה.",
    "present" => "שדה: שדה התכונה חייב להיות נוכח.",
    "regex" => "פורמט התכונה אינו חוקי.",
    "required" => "שדה התכונה נדרש.",
    "required_if" => "השדה: שדה תכונה נדרש כאשר: אחר הוא: ערך.",
    "required_unless" => "השדה: שדה תכונה נדרש אלא אם כן: אחר נמצא ב: ערכים.",
    "required_with" => "השדה: שדה תכונה נדרש כאשר: ערכים קיימים.",
    "required_with_all" => "השדה: שדה תכונה נדרש כאשר: ערכים קיימים.",
    "required_without" => "השדה: שדה תכונה נדרש כאשר: ערכים אינם קיימים.",
    "required_without_all" => "השדה: שדה תכונה נדרש כאשר אף אחד מהם אינו קיים.",
    "same" => "התכונה ו: אחר חייבים להתאים.",
    "size" => [
        "numeric" => "התכונה חייבת להיות: גודל.",
        "file" => "התכונה חייבת להיות: קילובייטים בגודל.",
        "string" => "התכונה חייבת להיות: תווים בגודל.",
        "array" => "התכונה חייבת להכיל: פריטי גודל."
    ],
    "starts_with" => "התכונה חייבת להתחיל עם אחד מהדברים הבאים:: ערכים.",
    "string" => "התכונה: חייבת להיות מחרוזת.",
    "timezone" => "התכונה חייבת להיות אזור תקף.",
    "unique" => "התכונה כבר נלקחה.",
    "uploaded" => "התכונה לא הצליחה להעלות.",
    "url" => "פורמט התכונה אינו חוקי.",
    "uuid" => "התכונה חייבת להיות UUID תקפה.",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "המסה בהתאמה אישית"
        ]
    ],
    "attributes" => []
];
