<?php

return [
    "accepted" => ": विशेषता को स्वीकार किया जाना चाहिए।",
    "active_url" => ": विशेषता एक मान्य URL नहीं है।",
    "after" => ": विशेषता के बाद एक तारीख होनी चाहिए: दिनांक।",
    "after_or_equal" => ": विशेषता के बाद या उसके बराबर तारीख होनी चाहिए: दिनांक।",
    "alpha" => ": विशेषता में केवल अक्षर हो सकते हैं।",
    "alpha_dash" => ": विशेषता में केवल अक्षर, संख्या, डैश और अंडरस्कोर हो सकते हैं।",
    "alpha_num" => ": विशेषता में केवल अक्षर और संख्या हो सकती है।",
    "array" => ": विशेषता एक सरणी होनी चाहिए।",
    "before" => ": विशेषता पहले एक तारीख होनी चाहिए: दिनांक।",
    "before_or_equal" => ": विशेषता से पहले या बराबर की तारीख होनी चाहिए: दिनांक।",
    "between" => [
        "numeric" => ": विशेषता के बीच होना चाहिए: मिन और: अधिकतम।",
        "file" => ": विशेषता के बीच होना चाहिए: मिन और: मैक्स किलोबाइट्स।",
        "string" => ": विशेषता के बीच होना चाहिए: मिन और: अधिकतम वर्ण।",
        "array" => ": विशेषता के बीच होना चाहिए: मिन और: अधिकतम आइटम।"
    ],
    "boolean" => ": विशेषता फ़ील्ड सही या गलत होना चाहिए।",
    "confirmed" => ": विशेषता पुष्टि मेल नहीं खाती है।",
    "date" => ": विशेषता एक वैध तिथि नहीं है।",
    "date_equals" => ": विशेषता के बराबर एक तारीख होनी चाहिए: दिनांक।",
    "date_format" => ": विशेषता प्रारूप से मेल नहीं खाती है: प्रारूप।",
    "different" => ": विशेषता और: अन्य अलग होना चाहिए।",
    "digits" => ": विशेषता होना चाहिए: अंक अंक।",
    "digits_between" => ": विशेषता के बीच होना चाहिए: मिन और: अधिकतम अंक।",
    "dimensions" => ": विशेषता में अमान्य छवि आयाम हैं।",
    "distinct" => ": विशेषता फ़ील्ड का एक डुप्लिकेट मान है।",
    "email" => ": विशेषता एक मान्य ईमेल पता होना चाहिए।",
    "ends_with" => ": विशेषता निम्नलिखित में से एक के साथ समाप्त होनी चाहिए:: मान।",
    "exists" => "चयनित: विशेषता अमान्य है।",
    "file" => ": विशेषता एक फ़ाइल होनी चाहिए।",
    "filled" => ": विशेषता फ़ील्ड का एक मान होना चाहिए।",
    "gt" => [
        "numeric" => ": विशेषता से अधिक होना चाहिए: मूल्य।",
        "file" => ": विशेषता से अधिक होना चाहिए: मूल्य किलोबाइट्स।",
        "string" => ": विशेषता से अधिक होना चाहिए: मूल्य वर्ण।",
        "array" => ": विशेषता से अधिक होना चाहिए: मूल्य आइटम।"
    ],
    "gte" => [
        "numeric" => ": विशेषता से अधिक या बराबर होना चाहिए: मूल्य।",
        "file" => ": विशेषता से अधिक या बराबर होना चाहिए: मूल्य किलोबाइट्स।",
        "string" => ": विशेषता से अधिक या बराबर होना चाहिए: मूल्य वर्ण।",
        "array" => ": विशेषता के पास होना चाहिए: मूल्य आइटम या अधिक।"
    ],
    "image" => ": विशेषता एक छवि होनी चाहिए।",
    "in" => "चयनित: विशेषता अमान्य है।",
    "in_array" => ": विशेषता फ़ील्ड में मौजूद नहीं है: अन्य।",
    "integer" => ": विशेषता एक पूर्णांक होना चाहिए।",
    "ip" => ": विशेषता एक मान्य आईपी पता होना चाहिए।",
    "ipv4" => ": विशेषता एक मान्य IPv4 पता होना चाहिए।",
    "ipv6" => ": विशेषता एक मान्य IPv6 पता होना चाहिए।",
    "json" => ": विशेषता एक मान्य JSON स्ट्रिंग होनी चाहिए।",
    "lt" => [
        "numeric" => ": विशेषता से कम होना चाहिए: मूल्य।",
        "file" => ": विशेषता से कम होना चाहिए: मूल्य किलोबाइट्स।",
        "string" => ": विशेषता से कम होना चाहिए: मूल्य वर्ण।",
        "array" => ": विशेषता से कम होना चाहिए: मूल्य आइटम।"
    ],
    "lte" => [
        "numeric" => ": विशेषता से कम या बराबर होना चाहिए: मूल्य।",
        "file" => ": विशेषता से कम या बराबर होना चाहिए: मूल्य किलोबाइट्स।",
        "string" => ": विशेषता से कम या बराबर होना चाहिए: मूल्य वर्ण।",
        "array" => ": विशेषता से अधिक नहीं होना चाहिए: मूल्य आइटम।"
    ],
    "max" => [
        "numeric" => ": विशेषता से अधिक नहीं हो सकता है: अधिकतम।",
        "file" => ": विशेषता से अधिक नहीं हो सकता है: मैक्स किलोबाइट्स।",
        "string" => ": विशेषता से अधिक नहीं हो सकता है: अधिकतम वर्ण।",
        "array" => ": विशेषता से अधिक नहीं हो सकता है: अधिकतम आइटम।"
    ],
    "mimes" => ": विशेषता प्रकार की एक फ़ाइल होनी चाहिए:: मान।",
    "mimetypes" => ": विशेषता प्रकार की एक फ़ाइल होनी चाहिए:: मान।",
    "min" => [
        "numeric" => ": विशेषता कम से कम होना चाहिए: मिनट।",
        "file" => ": विशेषता कम से कम होनी चाहिए: मिन किलोबाइट्स।",
        "string" => ": विशेषता कम से कम होना चाहिए: न्यूनतम वर्ण।",
        "array" => ": विशेषता कम से कम होनी चाहिए: न्यूनतम आइटम।"
    ],
    "not_in" => "चयनित: विशेषता अमान्य है।",
    "not_regex" => ": विशेषता प्रारूप अमान्य है।",
    "numeric" => ": विशेषता एक संख्या होनी चाहिए।",
    "password" => "पासवर्ड गलत है।",
    "present" => ": विशेषता फ़ील्ड मौजूद होना चाहिए।",
    "regex" => ": विशेषता प्रारूप अमान्य है।",
    "required" => ": विशेषता फ़ील्ड की आवश्यकता है।",
    "required_if" => ": विशेषता फ़ील्ड की आवश्यकता है जब: अन्य है: मान।",
    "required_unless" => ": विशेषता फ़ील्ड की आवश्यकता है जब तक: अन्य में है: मान।",
    "required_with" => ": विशेषता फ़ील्ड की आवश्यकता है जब: मान मौजूद है।",
    "required_with_all" => ": विशेषता फ़ील्ड की आवश्यकता है जब: मान मौजूद हैं।",
    "required_without" => ": विशेषता फ़ील्ड की आवश्यकता है जब: मान मौजूद नहीं है।",
    "required_without_all" => ": विशेषता फ़ील्ड की आवश्यकता होती है जब कोई भी: मान मौजूद नहीं है।",
    "same" => ": विशेषता और: अन्य से मेल खाना चाहिए।",
    "size" => [
        "numeric" => ": विशेषता होना चाहिए: आकार।",
        "file" => ": विशेषता होना चाहिए: आकार किलोबाइट्स।",
        "string" => ": विशेषता होना चाहिए: आकार वर्ण।",
        "array" => ": विशेषता में होना चाहिए: आकार आइटम।"
    ],
    "starts_with" => ": विशेषता निम्नलिखित में से एक के साथ शुरू होनी चाहिए:: मान।",
    "string" => ": विशेषता एक स्ट्रिंग होनी चाहिए।",
    "timezone" => ": विशेषता एक वैध क्षेत्र होना चाहिए।",
    "unique" => ": विशेषता पहले ही ली जा चुकी है।",
    "uploaded" => ": विशेषता अपलोड करने में विफल रही।",
    "url" => ": विशेषता प्रारूप अमान्य है।",
    "uuid" => ": विशेषता एक मान्य UUID होना चाहिए।",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "सीमा शुल्क संदेश"
        ]
    ],
    "attributes" => []
];
